In [1]:
import pandas as pd
  
# dictionary with list object in values
details = {
    'Name' : ['Ankit', 'Aishwarya', 'Shaurya','Shivangi'],
    'Age' : [23, 21, 22,21],
    'University' : ['BHU', 'JNU', 'DU', 'BHU'],
}
  
# creating a Dataframe object
df = pd.DataFrame(details,columns = ['Name','Age','University'],
                  index = ['a', 'b', 'c', 'd'])

In [2]:
df

        Name  Age University
a      Ankit   23        BHU
b  Aishwarya   21        JNU
c    Shaurya   22         DU
d   Shivangi   21        BHU

In [3]:
# return a new dataframe by dropping a
# row 'c' from dataframe
update_df = df.drop('c')
 
update_df

        Name  Age University
a      Ankit   23        BHU
b  Aishwarya   21        JNU
d   Shivangi   21        BHU

In [4]:
update_df = df.drop(['b', 'c']) #drop rows
 
update_df

       Name  Age University
a     Ankit   23        BHU
d  Shivangi   21        BHU

In [5]:
df.drop(['c', 'd'], inplace = True )
 
df

        Name  Age University
a      Ankit   23        BHU
b  Aishwarya   21        JNU

In [14]:

df.drop('Age', axis = 1, inplace = True) #drop columns
print(df)

        Name University
a      Ankit        BHU
b  Aishwarya        JNU

In [ ]:
# np.where
df ["GENDER"] = np.where(df["GENDER"].isin(['F', 'female', 'Femal']), 'F','M')

The code snippet converts the values in the 'GENDER' column to either 'F' or 'M'. If the original value in the 'GENDER' column is 'F', 'female', or 'Femal', it is replaced with 'F'. Otherwise, it is replaced with 'M'. This is a common technique for standardizing gender values in datasets where multiple representations of the same gender category exist.

In [ ]:
# start of our analysis and modelling
data.shape
data.dtypes
data['duration'].value_counts(dropna=False)

In [ ]:
# both '' and ' ' seem to indicate unknown values, I will group them together
def cleankSymbol(x):
    x = x.lower()
    if x in ['', ' ']:
        return 'unknown'
    else:
        return x

data['k_symbol'] = list(map(cleankSymbol, data['k_symbol']))  #uses map

In [ ]:
-- or use .apply()

def cleanOperation(x):
    x = x.lower()
    if 'vyber' in x:
        return "vyber"
    elif 'prevod' in x:
        return "prevod"
    elif 'vklad' in x:
        return 'vklad'
    else:
        return 'unknown'

#data['operation'] = list(map(cleanOperation, data['operation']))
data['operation'] = data['operation'].apply(cleanOperation)

In [ ]:
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [ ]:
# Checking for multicollinearity

corr_matrix=data.corr()  # default
fig, ax = plt.subplots(figsize=(10, 8))
ax = sns.heatmap(corr_matrix, annot=True)
plt.show()

In [ ]:
# Train scalers with training data, do , split,train,test, rather than a sneak peak at the whole data and how the results perform
Scaling and encoding still required
minMax - to be read on a column basis, ie. 69% of total payments
Still need to transform categoricals
# this is a change from week 1
Categorical classification method uses logistical regression

In [ ]:
# numerical data (columns)
# train model on trained scaled data
# then do predictions 
always need to scale in ML, use minmaxscaler - numerical data
# look up information bleeding

In [ ]:
#encode categoricals with onehotencoder, drop one colum
encoder - trains training data
encoded . trains test data (smaller set of data, usually)

In [ ]:
Discussion on test data
dont fit X_test num again
Look, at scaled test data, for any min (below 0) and max (above 1)- Can exclude from the test set. 
(X_test_cat)
Use X_test_treated for predictions
predictions = classification.predict(X_test_treated)
predictions ## produces an array
classification.score(X_test_treated, y_test) ## guess correctly for 88% of time
model favours the majority
confusion matrix(actuals, predictions)

In [ ]:
import pandas as pd
from sklearn.preprocessing import OneHotEncoder

# Sample DataFrame with 'Name', 'Type 1', and 'Type 2' columns
data = {'Name': ['Pikachu', 'Charmander', 'Squirtle'],
        'Type 1': ['Electric', 'Fire', 'Water'],
        'Type 2': ['None', 'None', 'None']}
pokemon = pd.DataFrame(data)

# Create an instance of OneHotEncoder
encoder = OneHotEncoder(sparse=False)

# Fit and transform the encoder on 'Type 1' and 'Type 2' columns
encoded_columns = encoder.fit_transform(pokemon[['Type 1', 'Type 2']])

# Create column names for the encoded features
encoded_feature_names = encoder.get_feature_names(['Type1', 'Type2'])

# Create a DataFrame with the encoded features
encoded_df = pd.DataFrame(encoded_columns, columns=encoded_feature_names)

# Concatenate the encoded DataFrame with the original DataFrame
pokemon_encoded = pd.concat([pokemon, encoded_df], axis=1)

print(pokemon_encoded)

Cleaning up prefixed data or characters in the Name column

In [ ]:
def remove_mega_prefix(name):
    if "Mega" in name:
        return "Mega" + name.split("Mega" ,1)[1]
    else:
        return name


pokemon["Name"] = pokemon["Name"].apply(remove_mega_prefix)

pokemon.head(10)

IQR - removing outliers and variables

In [ ]:
p.percentile(continuous_df['monthly_premium_auto'],75) - np.percentile(numerical_df['monthly_premium_auto'],25)